import { createContext } from "react";

const Hair = {
    name: 'Bолосковая техника',
    list: [
        {
            id: 1,
            test: 'Гармоничность образа',
            dect: 'Оценивается общий вид модели: опрятность, чистота, ухоженность. Гармоничность подбора формы и цвета в комплексе для данной модели. Также оценивается на сколько конкурсант подчеркнул индивидуальность. Cyмел ли участник добиться индивидуальности',
        },
        {
            id: 2,
            test: 'Форма',
            dect: 'Оценивается насколько участник корректно и естественно подобрал форму для модели.',
        },
        {
            id: 3,
            test: 'Естественность укладки волосков',
            dect: 'Оценивается соответствиe нанесенного рисунка приданой форме укладки брови модели.',
        },
        {
            id: 4,
            test: 'Четкость и изящность волоска',
            dect: 'Оценивается равномерность и насыщенность цвета, прокраса волоска, изгиб, утонченность с двух сторон и толщина.',
        },
        {
            id: 5,
            test: 'Правильное расстояние волосков друг от друга',
            dect: 'Оценивается допустимoе расстояниe между волосками.',
        },
        {
            id: 6,
            test: 'Цвет',
            dect: 'Оценивается гармоничность подбора цвета брови исходя из цветотипа модели, ее цвета кожи, волос и глаз.',
        },
        {
            id: 7,
            test: 'Симметрия',
            dect: 'Оценивается насколько участник смог выровнять природную асимметрию исходя из анатомических исходных данных, а также симметричность деталей губ относительно друг к другу. И симметричность укладки волоска на двух бровях.',
        },
        {
            id: 8,
            test: 'Травматизация',
            dect: 'Оценивается наличие засаженных линий, отека, нахлёст одного волоска на другой , явное покраснение. Чем меньше этих признаков тем выше балл.',
        },
        {
            id: 9,
            test: 'Сложность работы',
            dect: 'Оценивается также кожа модели и первоначальное наличие своих природных волосков.',
        },
        {
            id: 10,
            test: 'Укладка волосков',
            dect: 'Оценивается сложность рисунка укладки волосков. Гармоничность подбора укладки волосков под уже имеющиеся волоски на бровях модели. Выделение темных и светлых зон бровей.',
        }
    ]
}

const Microblading = {
    name: 'Микроблейдинг',
    list: [
        {
            id: 11,
            test: 'Гармоничность образа',
            dect: 'Оценивается общий вид модели: опрятность, чистота, ухоженность. Гармоничность подбора формы и цвета в комплексе для данной модели. Также оценивается на сколько конкурсант подчеркнул индивидуальность. Cyмел ли участник добиться индивидуальности',
        },
        {
            id: 12,
            test: 'Форма',
            dect: 'Оценивается насколько участник корректно и естественно подобрал форму для модели.',
        },
        {
            id: 13,
            test: 'Естественность укладки волосков',
            dect: 'Оценивается соответствиe нанесенного рисунка приданой форме укладки брови модели.',
        },
        {
            id: 14,
            test: 'Четкость и изящность волоска',
            dect: 'Оценивается равномерность и насыщенность цвета, прокраса волоска, изгиб, утонченность с двух сторон и толщина.',
        },
        {
            id: 15,
            test: 'Правильное расстояние волосков друг от друга',
            dect: 'Оценивается допустимoе расстояниe между волосками.',
        },
        {
            id: 16,
            test: 'Цвет',
            dect: 'Оценивается гармоничность подбора цвета брови исходя из цветотипа модели, ее цвета кожи, волос и глаз.',
        },
        {
            id: 17,
            test: 'Симметрия',
            dect: 'Оценивается насколько участник смог выровнять природную асимметрию исходя из анатомических исходных данных, а также симметричность деталей губ относительно друг к другу. И симметричность укладки волоска на двух бровях.',
        },
        {
            id: 18,
            test: 'Травматизация',
            dect: 'Оценивается наличие засаженных линий, отека, нахлёст одного волоска на другой , явное покраснение. Чем меньше этих признаков тем выше балл.',
        },
        {
            id: 19,
            test: 'Сложность работы',
            dect: 'Оценивается также кожа модели и первоначальное наличие своих природных волосков.',
        },
        {
            id: 20,
            test: 'Укладка волосков',
            dect: 'Оценивается сложность рисунка укладки волосков. Гармоничность подбора укладки волосков под уже имеющиеся волоски на бровях модели. Выделение темных и светлых зон бровей.',
        }
    ]
}

const Lips = {
    name: 'Эффект губной помады',
    list: [
        {
            id: 21,
            test: 'Гармоничность образа',
            dect: 'Оценивается общий вид модели: опрятность, чистота, ухоженность. Также оценивается на сколько конкурсант подчеркнул индивидуальность. Правильно подобранное визажное решение.',
        },
        {
            id: 22,
            test: 'Форма',
            dect: 'Оценивается соответствие формы анатомическим особенностям строения лица, излишний выход за контур. Также насколько участник корректно и естественно подобрал форму для модели.',
        },
        {
            id: 23,
            test: 'Цвет',
            dect: 'Оценивается гармоничное сочетание выбранных цветов пигмента по тону кожи модели.',
        },
        {
            id: 24,
            test: 'Симметрия',
            dect: 'Оценивается насколько участник смог выровнить природную асимметрию исходя из анатомических исходных данных модели.',
        },
        {
            id: 25,
            test: 'Контур',
            dect: 'Оценивается равномерность прокраса контура. Ровность линии контура. Правильный выбор типа контура (мало видный - средне видный - четко видный). Под индивидуальную форму губ модели (большие, маленькие и т.д.)',
        },
        {
            id: 26,
            test: 'Прокрас',
            dect: 'Оценивается равномерный плотный прокрас по всей площади губ.',
        },
        {
            id: 27,
            test: 'Травматизация',
            dect: 'Оценивается наличие засаженных точек, отека, проколов в виде тире, явное углубление, выходы за контур губ. Чем меньше этих признаков тем выше балл.',
        },
        {
            id: 28,
            test: 'Сложность работы',
            dect: 'Оценивается сложность техники введения пигмента, а также кожа модели, использование перехода цветов.',
        },
        {
            id: 29,
            test: 'Равномерность прокраса',
            dect: 'Одинаковое количество пикселей по контуру, общий вид растушевки.',
        }
    ]
}

const Arrow = {
    name: 'Стрелка с прокрасом межресничного пространства и Растушевкой',
    list: [
        {
            id: 31,
            test: 'Гармоничность образа',
            dect: 'Оценивается общий вид модели: опрятность, чистота, ухоженность. Также оценивается на сколько конкурсант подчеркнул индивидуальность. Правильно подобранное визажное решение.',
        },
        {
            id: 32,
            test: 'Форма',
            dect: 'Оценивается насколько участник подобрал ширину и длину стрелочки, а также соответствия формы стрелки/растушёвки анатомическим особенностям строения глаз/лица.',
        },
        {
            id: 33,
            test: 'Симметрия',
            dect: 'Оценивается насколько участник смог выровнять природную симметрию исходя из анатомических исходных данных модели.',
        },
        {
            id: 34,
            test: 'Изящность',
            dect: 'Оценивается плавное истончение линии в хвостике и внутреннем углу глаза.',
        },
        {
            id: 35,
            test: 'Градиент',
            dect: 'Оценивается насколько профессионально и плавно выполнен переход от светлых частей век к более тёмным.',
        },
        {
            id: 36,
            test: 'Прокрас межресничного пространства',
            dect: 'Оценивается равномерное плотное окрашивание всей межресничной зоны.',
        },
        {
            id: 37,
            test: 'Цвет',
            dect: 'Оценивается гармоничное сочетание выбранных цветов пигмента по тону кожи модели. Разрешенные цвета для использования - чёрный, серый и коричневый.',
        },
        {
            id: 38,
            test: 'Травматизация',
            dect: 'Оценивается наличие засаженных точек, отека, проколов в виде тире, явное углубление, выходы за контур губ. Чем меньше этих признаков тем выше балл.',
        },
    ]
}

const Feathering = {
    name: 'Растушевка',
    list: [
        {
            id: 41,
            test: 'Гармоничность образа',
            dect: 'Оценивается общий вид модели: опрятность, чистота, ухоженность. Также оценивается на сколько конкурсант подчеркнул индивидуальность. Cyмел ли участник добиться индивидуальности.'
        },
        {
            id: 42,
            test: 'Форма',
            dect: 'Оценивается гармоничная ширина, длина и пропорция брови в соответствии с анатомическим строением лица модели.'
        },
        {
            id: 43,
            test: 'Цвет',
            dect: 'Оценивается гармоничность подбора цвета своей работы исходя из цветотипа модели, её цвета кожи, волос, и глаз.'
        },
        {
            id: 44,
            test: 'Симметрия',
            dect: 'Оценивается насколько участник смог выровнить природную асимметрию брови исходя из анатомических исходных данных у модели'
        },
        {
            id: 45,
            test: 'Травматизация',
            dect: 'Оценивается наличие засаженных точек, отека, проколов в виде тире, явное углубление, выходы за контур губ. <b>Чем меньше этих признаков тем выше балл.</b>'
        },
        {
            id: 46,
            test: 'Оформление головки брови',
            dect: 'Оценивается симметричность по отношению одной брови ко второй брови, изящность и мягкость.'
        },
        {
            id: 47,
            test: 'Градиент',
            dect: 'Оценивается плавность перехода цвета и интенсивность.'
        }
    ]
}

export const TasksContext = createContext([
    Hair, Microblading, Lips, Feathering, Arrow
]);